IDEA StatiCa Open Model
LineSupport.X Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 displacement in X
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool X { get; set; }
Public Property X As Boolean
	Get
	Set
public:
property bool X {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
LineSupport Class
IdeaRS.OpenModel.Detail Namespace